espressif/esp-idf/components/esp_hal_ledc/esp32s31/include/hal/ledc_ll.h
#define LEDC_LL_ETM_TIMER_EVENT_EN_REG(group, event) \
    ((volatile uint32_t *)((uintptr_t)((volatile uint32_t *[1][LEDC_TIMER_ETM_EVENT_MAX]){{ \
        [LEDC_TIMER_ETM_EVENT_OVF] = (volatile uint32_t *)LEDC_EVT_TASK_EN0_REG(0), \
    }}[0][(event)]) + (uintptr_t)(group) * LEDC_LL_ETM_REG_GROUP_OFS))

#define LEDC_LL_ETM_TIMER_EVENT_EN_BIT(group, timer, event) \
    ((uint32_t [1][LEDC_TIMER_ETM_EVENT_MAX]){{ \
        [LEDC_TIMER_ETM_EVENT_OVF] = BIT(LEDC_EVT_TIME_OVF_TIMER0_EN_S), \
    }}[0][(event)] << (timer))

#ifdef __cplusplus
extern "C" {
#endif

typedef enum {
    LEDC_LL_MEM_LP_MODE_DEEP_SLEEP,    // memory will enter deep sleep during low power stage, keep memory data
    LEDC_LL_MEM_LP_MODE_LIGHT_SLEEP,   // memory will enter light sleep during low power stage, keep memory data
    LEDC_LL_MEM_LP_MODE_SHUT_DOWN,     // memory will be powered down during low power stage
    LEDC_LL_MEM_LP_MODE_DISABLE,       // disable the low power stage
} ledc_ll_mem_lp_mode_t;

/**
 * @brief Enable peripheral register clock
 *
 * @param group_id  LEDC group ID
 * @param enable    Enable/Disable
 */
static inline void ledc_ll_enable_bus_clock(int group_id, bool enable)
{
    switch (group_id) {
    case 0:
        HP_SYS_CLKRST.ledc_ctrl0.reg_ledc0_apb_clk_en = enable;
        break;
    case 1:
        HP_SYS_CLKRST.ledc_ctrl0.reg_ledc1_apb_clk_en = enable;
        break;
    default:
        abort();
        break;
    }
}

/// use a macro to wrap the function, force the caller to use it in a critical section
/// the critical section needs to declare the __DECLARE_RCC_ATOMIC_ENV variable in advance
#define ledc_ll_enable_bus_clock(...) do { \
    (void)__DECLARE_RCC_ATOMIC_ENV; \
    ledc_ll_enable_bus_clock(__VA_ARGS__); \
} while(0)

/**
 * @brief Reset whole peripheral register to init value defined by HW design
 *
 * @param group_id  LEDC group ID
 */
static inline void ledc_ll_reset_register(int group_id)
{
    switch (group_id) {
    case 0:
        HP_SYS_CLKRST.ledc_ctrl0.reg_ledc0_rst_en = 1;
        HP_SYS_CLKRST.ledc_ctrl0.reg_ledc0_rst_en = 0;
        break;
    case 1:
        HP_SYS_CLKRST.ledc_ctrl0.reg_ledc1_rst_en = 1;
        HP_SYS_CLKRST.ledc_ctrl0.reg_ledc1_rst_en = 0;
        break;
    default:
        abort();
        break;
    }
}

/// use a macro to wrap the function, force the caller to use it in a critical section
/// the critical section needs to declare the __DECLARE_RCC_ATOMIC_ENV variable in advance
#define ledc_ll_reset_register(...) do { \
    (void)__DECLARE_RCC_ATOMIC_ENV; \
    ledc_ll_reset_register(__VA_ARGS__); \
} while(0)

/**
 * @brief Force power on the LEDC memory block, regardless of the outside PMU logic
 *
 * @param dev Peripheral instance address
 */
static inline void ledc_ll_mem_force_power_on(ledc_dev_t *dev)
{
    if (dev == &LEDC0) {
        HP_SYSTEM.sys_ledc0_mem_lp_ctrl.sys_ledc0_mem_force_ctrl = 1;
        HP_SYSTEM.sys_ledc0_mem_lp_ctrl.sys_ledc0_mem_lp_en = 0;
    } else if (dev == &LEDC1) {
        HP_SYSTEM.sys_ledc1_mem_lp_ctrl.sys_ledc1_mem_force_ctrl = 1;
        HP_SYSTEM.sys_ledc1_mem_lp_ctrl.sys_ledc1_mem_lp_en = 0;
    } else {
        abort();
    }
}

/**
 * @brief Force the LEDC memory block into low power mode, regardless of the outside PMU logic
 *
 * @param dev Peripheral instance address
 */
static inline void ledc_ll_mem_force_low_power(ledc_dev_t *dev)
{
    if (dev == &LEDC0) {
        HP_SYSTEM.sys_ledc0_mem_lp_ctrl.sys_ledc0_mem_force_ctrl = 1;
        HP_SYSTEM.sys_ledc0_mem_lp_ctrl.sys_ledc0_mem_lp_en = 1;
    } else if (dev == &LEDC1) {
        HP_SYSTEM.sys_ledc1_mem_lp_ctrl.sys_ledc1_mem_force_ctrl = 1;
        HP_SYSTEM.sys_ledc1_mem_lp_ctrl.sys_ledc1_mem_lp_en = 1;
    } else {
        abort();
    }
}

/**
 * @brief Power control the LEDC memory block by the outside PMU logic
 *
 * @param dev Peripheral instance address
 */
static inline void ledc_ll_mem_power_by_pmu(ledc_dev_t *dev)
{
    if (dev == &LEDC0) {
        HP_SYSTEM.sys_ledc0_mem_lp_ctrl.sys_ledc0_mem_force_ctrl = 0;
        HP_SYSTEM.sys_ledc0_mem_lp_ctrl.sys_ledc0_mem_lp_en = 0;
    } else if (dev == &LEDC1) {
        HP_SYSTEM.sys_ledc1_mem_lp_ctrl.sys_ledc1_mem_force_ctrl = 0;
        HP_SYSTEM.sys_ledc1_mem_lp_ctrl.sys_ledc1_mem_lp_en = 0;
    } else {
        abort();
    }
}

/**
 * @brief Set low power mode for LEDC memory block
 *
 * @param dev Peripheral instance address
 * @param mode LEDC memory low power mode in low power stage
 */
static inline void ledc_ll_mem_set_low_power_mode(ledc_dev_t *dev, ledc_ll_mem_lp_mode_t mode)
{
    if (dev == &LEDC0) {
        HP_SYSTEM.sys_ledc0_mem_lp_ctrl.sys_ledc0_mem_lp_mode = mode;
    } else if (dev == &LEDC1) {
        HP_SYSTEM.sys_ledc1_mem_lp_ctrl.sys_ledc1_mem_lp_mode = mode;
    } else {
        abort();
    }
}

/**
 * @brief Enable LEDC function clock
 *
 * @param group_id  LEDC group ID
 * @param en True to enable, false to disable
 *
 * @return None
 */
static inline void ledc_ll_enable_clock(int group_id, bool en)
{
    switch (group_id) {
    case 0:
        HP_SYS_CLKRST.ledc_ctrl0.reg_ledc0_clk_en = en;
        break;
    case 1:
        HP_SYS_CLKRST.ledc_ctrl0.reg_ledc1_clk_en = en;
        break;
    default:
        abort();
        break;
    }
}

/// use a macro to wrap the function, force the caller to use it in a critical section
/// the critical section needs to declare the __DECLARE_RCC_ATOMIC_ENV variable in advance
#define ledc_ll_enable_clock(...) do { \
    (void)__DECLARE_RCC_ATOMIC_ENV; \
    ledc_ll_enable_clock(__VA_ARGS__); \
} while(0)

/**
 * @brief Enable the power for LEDC channel
 *
 * @param hw Beginning address of the peripheral registers
 * @param speed_mode LEDC speed_mode, low-speed mode only
 * @param channel_num LEDC channel index (0-7), select from ledc_channel_t
 * @param en True to enable, false to disable
 */
static inline void ledc_ll_enable_channel_power(ledc_dev_t *hw, ledc_mode_t speed_mode, ledc_channel_t channel_num, bool en)
{
    if (en) {
        hw->ch_power_up_conf.val |= BIT(speed_mode * SOC_LEDC_CHANNEL_NUM + channel_num);
    } else {
        hw->ch_power_up_conf.val &= ~BIT(speed_mode * SOC_LEDC_CHANNEL_NUM + channel_num);
    }
}

/**
 * @brief Enable the power for LEDC timer
 *
 * @param hw Beginning address of the peripheral registers
 * @param speed_mode LEDC speed_mode, low-speed mode only
 * @param timer_sel LEDC timer index (0-3), select from ledc_timer_t
 * @param en True to enable, false to disable
 */
static inline void ledc_ll_enable_timer_power(ledc_dev_t *hw, ledc_mode_t speed_mode, ledc_timer_t timer_sel, bool en)
{
    if (en) {
        hw->timer_power_up_conf.val |= BIT(speed_mode * SOC_LEDC_TIMER_NUM + timer_sel);
    } else {
        hw->timer_power_up_conf.val &= ~BIT(speed_mode * SOC_LEDC_TIMER_NUM + timer_sel);
    }
}

/**
 * @brief Set LEDC low speed timer clock
 *
 * @param hw Beginning address of the peripheral registers
 * @param slow_clk_sel LEDC low speed timer clock source
 *
 * @return None
 */
static inline void ledc_ll_set_slow_clk_sel(ledc_dev_t *hw, ledc_slow_clk_sel_t slow_clk_sel)
{
    uint32_t clk_sel_val = 3;
    switch (slow_clk_sel) {
    case LEDC_SLOW_CLK_XTAL:
        clk_sel_val = 0;
        break;
    case LEDC_SLOW_CLK_RC_FAST:
        clk_sel_val = 1;
        break;
    case LEDC_SLOW_CLK_PLL_DIV:
        clk_sel_val = 2;
        break;
    default:
        abort();
        break;
    }

